const stroyka_translate = {
  ru: {
    build_info: `
        <h1>Строительство многоквартирных домов</h1>
                    <div>
                        <p>Полный цикл строительства от проектирования до сдачи объектов в эксплуатацию.</p>
                    </div>
                    <div>
                        <p>Наши услуги:</p>
                        <p>Строительство многоквартирных домов - проектирование и архитектурные решения с учетом особенностей территорий.</p>
                        <p>Прочная конструкция фундамента и обеспечение сейсмостойкости.</p>
                        <p>Наружная и внутренняя отделка здания из качественных и прочных материалов.</p>
                    </div>
                    <div>
                        <p>Монтаж инженерных систем: отопление, вентиляция, кондиционирование, электроснабжение, водоснабжение.</p>
                        <p>Благоустройство.</p>
                        <p>Земляные работы.</p>
                        <p>Работы по сносу.</p>
                    </div>
                    <div>
                        <p>Мы строим надежные и современные многоэтажные комплексы, соответствующие высоким стандартам качества и безопасности, предлагая современные архитектурные решения, качественные материалы и энергоэффективные технологии.</p>
                    </div>
                    <div>
                        <p>Коммерческое строительство - строительство офисных зданий и торговых центров с учетом всех требований безопасности и функциональности.</p>
                    </div>
                    <div>
                        <p>Профессиональный надзор на всех этапах строительства, от планирования до отделки.</p>
                        <p>Лицензированные проектные работы</p>
                        <p>1․ Архитектурный проект</p>
                        <p>2. Конструкторский проект</p>
                        <p>3. Инженерный проект</p>
                        <p>4. Дизайн интерьера и экстерьера</p>
                        <p>5. Исходно-разрешительная документация - помощь в оформлении разрешительных документов</p>
                        <p>6. Сейсмический вывод</p>
                        <p>7․ Содействие в получении акта об окончании, сертификата</p>
        `,
    footer_1: 'Строительство',
    footer_2: 'Полезнные ссылки',
  },
  am: {
    build_info: `
        <h1>Բազմաբնակարան շենքերի կառուցում</h1>
                    <div>
                        <p>Շինարարության ամբողջական ցիկլ՝ նախագծումից մինչև օբյեկտների հանձնում շահագործման:</p>
                    </div>
                    <div>
                        <p>Մեր ծառայությունները ներառում են՝</p>
                        <p>Բազմաբնակարան շենքերի կառուցում · Նախագծում և ճարտարապետական լուծումներ՝ հաշվի առնելով տարածքի առանձնահատկությունները։</p>
                        <p>Հիմքի ամուր կառուցում և սեյսմակայունության ապահովում։Շենքի արտաքին և ներքին հարդարման աշխատանքներ՝ որակյալ և դիմացկուն նյութերով</p>
                    </div>
                    <div>
                        <p>Ինժեներական համակարգերի տեղադրում՝ ջեռուցում, հովացում,էլեկտրամատակարարում, ջրամատակարարում</p>
                        <p>Կանաչապատ և բարեկարգ բակային տարածքների ստեղծում։</p>
                        <p>Հողային աշխատանքներ</p>
                        <p>Քանդման աշխատանքներ</p>
                    </div>
                    <div>
                        <p>Մենք կառուցում ենք հուսալի և ժամանակակից բազմահարկ համալիրներ՝ համապատասխանելով որակի և անվտանգության բարձր չափանիշներին, առաջարկելով ժամանակակից ճարտարապետական լուծումներ, որակյալ նյութեր և էներգաարդյունավետ տեխնոլոգիաներ։</p>
                    </div>
                    <div>
                        <p>Կոմերցիոն շինարարություն Գրասենյակային շենքերի և առևտրային կենտրոնների կառուցում՝ անվտանգության և գործունակության բոլոր պահանջները հաշվի առնելով:</p>
                    </div>
                    <div>
                        <p>Մասնագիտական վերահսկողություն շինարարության բոլոր փուլերում՝ սկսած պլանավորումից մինչև ավարտ:</p>
                        <p>Նախագծման լիցենզավորված աշխատանքներ</p>
                        <p>1․ Ճարտարապետական նախագիծ</p>
                        <p>2. Կոնստրուկտորական նախագիծ</p>
                        <p>3. Ինժեներական նախագիծ</p>
                        <p>4. Ինտերիերի և Էքստերիերի դիզայն</p>
                        <p>5. Շին․ թույլտվության փաստաթղթային աշխատանքներով զբաղվելու աջակցություն</p>
                        <p>6. Սեյսմիկ եզրակացություն</p>
                        <p>7․ Ավարտական ակտի, վկայականի ստացման աջակցություն</p>`,
    footer_1: 'Շինարարություն',
    footer_2: 'Օգտակար հղումներ',
  },
};

const build_info =
  document.getElementById('build-section').firstElementChild.children[1];

const link_li = document.querySelector('.link-li').firstElementChild;

export function chang_lang(lang) {
  build_info.innerHTML = stroyka_translate[lang].build_info;
  link_li.children[0].textContent = stroyka_translate[lang].footer_1;
  link_li.children[1].textContent = stroyka_translate[lang].footer_2;
}
